perf/siu.yaml
config:
  environments:
    node:
      target: 'http://localhost:5555'
      plugins:
        statsd:
          host: localhost
          port: 8125
          prefix: "artillery-node"
    many:
      target: 'http://localhost:5555/many'
      plugins:
        statsd:
          host: localhost
          port: 8125
          prefix: "artillery-node-replicated"

  pool: 50 # All HTTP requests from all virtual users will be sent over the same connections

  phases:
    # En los primeros 10 minutos, tengo un rampup de 75 alumnos
    - name: Ansiosos
      duration: 600
      arrivalRate: 75
    # En los siguientes 20 minutos, tengo un arrival a ritmo constante de 25 alumnos
    - name: Relajados
      duration: 12000
      arrivalRate: 25


scenarios:
  - name: inscripcion a materias
    flow:
      - get:
          # /iniciar_sesion
          url: '/work/?n=1'
      - get:
          # /ver_materias_disponibles
          url: '/sync'
      - loop:
        # Ni 3, ni 5 (Basados en el promedio de Nico Paez: 3.84 materias por alumno)
          # /inscripcion
          - get:
              url: '/work/?n=3'
        count: 4
      - get:
          # /cerrar_sesion
          url: '/ping'