perf/siu.yaml
config:
  environments:
    node:
      target: 'http://localhost:5555'
      plugins:
        statsd:
          host: localhost
          port: 8125
          prefix: "artillery-node"
    many:
      target: 'http://localhost:5555/many'
      plugins:
        statsd:
          host: localhost
          port: 8125
          prefix: "artillery-node-replicated"

  pool: 50 # All HTTP requests from all virtual users will be sent over the same connections

  phases:
    # En los primeros 5 minutos, tengo 35 alumnos
    - name: HiperAnsiosos
      duration: 300
      arrivalCount: 35
    # En los siguientes 5 minutos, tengo 25 alumnos
    - name: Ansiosos
      duration: 300
      arrivalCount: 25
    # En los últimos 20 minutos, tengo los restantes 40 alumnos
    - name: Relajados
      duration: 1200
      arrivalCount: 40


scenarios:
  - name: inscripcion a materias
    flow:
      - get:
          # /iniciar_sesion
          url: '/work?n=1'
      - get:
          # /ver_materias_disponibles
          url: '/sync'
      - loop:
          # /inscripcion
          - get:
              url: '/work?n=3'
        # Ni 3, ni 5 (Basados en el promedio de Nico Paez: 3.84 materias por alumno)
        count: 4
      - get:
          # /cerrar_sesion
          url: '/ping'